-- View: "vw_заявка"

-- DROP VIEW "vw_заявка";

CREATE OR REPLACE VIEW "vw_заявка" AS 
 SELECT DISTINCT z."КОД_ПРАЙС" AS "КОД",
    s."ИМЯ",
    z."КОД_ТОВАР",
    s."КОД_ФИРМЫ",
    s."МИНЦЕНА" AS "ЦЕНА",
    z."КОЛ",
    z."КОДЗАКАЗ",
    z."КОДДОКЗАКАЗ",
    z."СТРДОКЗАКАЗ"
   FROM ( SELECT z_1."КОД_ПРАЙС",
            z_1."КОД_ТОВАР",
            z_1."КОЛ_ОБРАБОТАННОЕ" AS "КОЛ",
            z_1."КОД" AS "КОДЗАКАЗ",
            0 AS "КОДДОКЗАКАЗ",
            0 AS "СТРДОКЗАКАЗ"
           FROM "заявка" z_1
          WHERE z_1."КОД_ПРАЙС" > 0 AND z_1."КОД_ДОКУМЕНТЫ129" = 0
        UNION
         SELECT p."КОД_ПРАЙС",
            0 AS "КОД_ТОВАР",
            p."КОЛ",
            0 AS "КОДЗАКАЗ",
            p."КОДДОКЗАКАЗ",
            p."СТРДОКЗАКАЗ"
           FROM ( SELECT p_1."КРКОД" AS "КОД_ПРАЙС",
                    p_1."КОЛ",
                    d."КОД" AS "КОДДОКЗАКАЗ",
                    p_1."СТР" AS "СТРДОКЗАКАЗ"
                   FROM "проводки" p_1
                     JOIN ( SELECT d_1."КОД",
                            d_1."ДАТА",
                            d_1."ДАТАВРЕМЯ",
                            d_1."НОМЕР",
                            d_1."КОММЕНТАРИЙ",
                            d_1."СУММА",
                            d_1."ОПИСАНИЕ",
                            d_1."ОПЕР",
                            d_1."АВТО",
                            d_1."ПЕРЕМЕННЫЕ1",
                            d_1."ПЕРЕМЕННЫЕ",
                            d_1."КОД_ПЕРСОНАЛ"
                           FROM "документы" d_1
                             JOIN "докатрибуты3" da ON d_1."КОД" = da."КОД"
                          WHERE NOT da."ВЫПОЛНЕН" AND NOT da."ОТМЕНЕН") d ON p_1."ДОККОД" = d."КОД"
                     JOIN "атрибуты3" a ON p_1."ДОККОД" = a."ДОККОД" AND p_1."СТР" = a."СТР" AND NOT a."ВЫПОЛНЕН" AND NOT a."ОТМЕНЕН" AND NOT a."ПОСТУПИЛ" AND p_1."КОЛ" > 0::numeric AND a."КОДЗАКАЗ" = 0
                  WHERE p_1."ОПЕР" = 3::numeric) p) z
     LEFT JOIN "vw_прайс3" s ON z."КОД_ПРАЙС" = s."КОД"
  ORDER BY s."КОД_ФИРМЫ", s."ИМЯ";

ALTER TABLE "vw_заявка"
  OWNER TO sa;
