-- View: "vw_закупоч_цены_на_новый_товар"

-- DROP VIEW "vw_закупоч_цены_на_новый_товар";

CREATE OR REPLACE VIEW "vw_закупоч_цены_на_новый_товар" AS 
 SELECT DISTINCT s."КОД",
    s."КОД_АДРЕС",
    s."КОД_ТОВАР",
    s."ИМЯ",
    s."КОД_ГРУППЫ",
    s."ЦЕНА",
    round(s."ЗАКСУММА" / s."КОЛ", 2)::numeric(10,2) AS "ЗАКЦЕНА",
    s."КОНКОЛ"::NUMERIC(10, 3) AS "КОЛ",
    s."АВТОМАТ_ЦЕНА",
    s."ТИП"
   FROM ( SELECT '1'::text AS "ТИП",
            s_1."КОД",
            s_1."КОД_АДРЕС",
            s_1."КОД_ТОВАР",
            t."ИМЯ",
            t."КОД_ГРУППЫ",
            t."ЦЕНА",
            sum(s1."КОНСАЛЬДО" + s2."КОНСАЛЬДО") AS "ЗАКСУММА",
            sum(s1."КОНКОЛ")::numeric(10,3) AS "КОЛ",
            sum(s1."КОНКОЛ")::numeric(10,3) AS "КОНКОЛ",
            t."АВТОМАТ_ЦЕНА"
           FROM "набор1" s_1
             JOIN "сальдо" s1 ON s1."СЧЕТ" = '411'::bpchar AND s_1."КОД" = s1."КОД"
             JOIN "сальдо" s2 ON s2."СЧЕТ" = '421'::bpchar AND s_1."КОД" = s2."КОД"
             JOIN ( SELECT n."КОД",
                    n."ИМЯ",
                    n."КОД_ГРУППЫ",
                    COALESCE(n."ЦЕНА", 0::numeric)::numeric(10,2) AS "ЦЕНА",
                    n."АВТОМАТ_ЦЕНА"
                   FROM "набор1" s_2
                     JOIN "товар" n ON n."КОД" = s_2."КОД_ТОВАР" AND s_2."КОД_АДРЕС" = 513
                     JOIN "сальдо" c ON s_2."КОД" = c."КОД" AND c."СЧЕТ" = '411'::bpchar AND c."КОНКОЛ" <> 0::numeric) t ON s_1."КОД_ТОВАР" = t."КОД"
          WHERE s1."КОНКОЛ" <> 0::numeric
          GROUP BY s_1."КОД", s_1."КОД_АДРЕС", s_1."КОД_ТОВАР", t."ИМЯ", t."КОД_ГРУППЫ", t."ЦЕНА", t."АВТОМАТ_ЦЕНА"
        UNION
         SELECT '2'::text AS "ТИП",
            t."КОД",
            t."КОД_АДРЕС",
            s_1."КОД_ТОВАР",
            t."ИМЯ",
            t."КОД_ГРУППЫ",
            t."ЦЕНА",
            sum(s1."КОНСАЛЬДО") AS "ЗАКСУММА",
            sum(s1."КОНКОЛ")::numeric(10,3) AS "КОЛ",
            t."КОНКОЛ",
            t."АВТОМАТ_ЦЕНА"
           FROM "набор402" s_1
             JOIN "сальдо" s1 ON s1."СЧЕТ" = '402'::bpchar AND s_1."КОД" = s1."КОД" AND s1."КОНКОЛ" > 0::numeric
             JOIN ( SELECT COALESCE(s_2."КОД", 0) AS "КОД",
                    t_1."КОД" AS "КОД_ТОВАР",
                    t_1."ИМЯ",
                    t_1."КОД_ГРУППЫ",
                    COALESCE(t_1."ЦЕНА", 0::numeric) AS "ЦЕНА",
                    t_1."АВТОМАТ_ЦЕНА",
                    COALESCE(s_2."КОД_АДРЕС", 0) AS "КОД_АДРЕС",
                    COALESCE(s_2."КОНКОЛ", 0::numeric) AS "КОНКОЛ"
                   FROM "товар" t_1
                     JOIN ( SELECT s_3."КОД",
                            s_3."КОД_ТОВАР",
                            s_3."КОД_АДРЕС",
                            c."КОНКОЛ"
                           FROM "набор1" s_3
                             JOIN "сальдо" c ON s_3."КОД" = c."КОД" AND c."СЧЕТ" = '411'::bpchar AND c."КОНКОЛ" <> 0::numeric
                             ) s_2 ON t_1."КОД" = s_2."КОД_ТОВАР") t ON s_1."КОД_ТОВАР" = t."КОД_ТОВАР"
          GROUP BY t."КОД", t."КОД_АДРЕС", s_1."КОД_ТОВАР", t."ИМЯ", t."КОД_ГРУППЫ", t."ЦЕНА", t."АВТОМАТ_ЦЕНА", t."КОНКОЛ"
        UNION
         SELECT '3'::text AS "ТИП",
            t."КОД",
            t."КОД_АДРЕС",
            s_1."КОД_ТОВАР",
            t."ИМЯ",
            t."КОД_ГРУППЫ",
            t."ЦЕНА",
            sum(s1."КОНСАЛЬДО") AS "ЗАКСУММА",
            sum(s1."КОНКОЛ")::numeric(10,3) AS "КОЛ",
            sum(s1."КОНКОЛ")::numeric(10,3) AS "КОНКОЛ",
            t."АВТОМАТ_ЦЕНА"
           FROM "набор402" s_1
             JOIN "сальдо" s1 ON s1."СЧЕТ" = '402'::bpchar AND s_1."КОД" = s1."КОД" AND s1."КОНКОЛ" > 0::numeric
             JOIN ( SELECT 0 AS "КОД",
                    t_1."КОД" AS "КОД_ТОВАР",
                    t_1."ИМЯ",
                    t_1."КОД_ГРУППЫ",
                    COALESCE(t_1."ЦЕНА", 0::numeric) AS "ЦЕНА",
                    t_1."АВТОМАТ_ЦЕНА",
                    0 AS "КОД_АДРЕС",
                    COALESCE(s_2."КОНКОЛ", 0::NUMERIC) AS "КОНКОЛ"
                   FROM "товар" t_1
                     LEFT JOIN (SELECT s_3."КОД_ТОВАР",
                            SUM(c."КОНКОЛ") AS "КОНКОЛ"
                           FROM "набор1" s_3
                             JOIN "сальдо" c ON s_3."КОД" = c."КОД" AND c."СЧЕТ" = '411'::bpchar
                             GROUP BY s_3."КОД_ТОВАР") s_2 ON t_1."КОД" = s_2."КОД_ТОВАР"
             ) t ON s_1."КОД_ТОВАР" = t."КОД_ТОВАР" AND t."КОНКОЛ" = 0
          GROUP BY t."КОД", t."КОД_АДРЕС", s_1."КОД_ТОВАР", t."ИМЯ", t."КОД_ГРУППЫ", t."ЦЕНА", t."АВТОМАТ_ЦЕНА"
          ) s;
          

ALTER TABLE "vw_закупоч_цены_на_новый_товар"
  OWNER TO sa;
GRANT ALL ON TABLE "vw_закупоч_цены_на_новый_товар" TO sa;
